apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_tim.c
      value_32 &= LOW_20_MASK;
      *value   |= value_32;
      *value  <<= SHIFT_32;
      value_32 = getreg32(SYS_TIMER_SYSTIMER_UNIT1_VALUE_LO_REG);
      *value   |= value_32;
    }
  else
    {
      /* Dummy value (0 or 1) to latch the counter value to read it */

      putreg32(BIT(0), TIMG_T0UPDATE_REG(priv->id));

      /* Read value */

      value_32  = getreg32(TIMG_T0HI_REG(priv->id)); /* High 32 bits */

      /* Discard the top 10 bits */

      value_32 &= LOW_22_MASK;
      *value   |= value_32;
      *value  <<= SHIFT_32;
      value_32  = getreg32(TIMG_T0LO_REG(priv->id)); /* Low 32 bits */
      *value   |= value_32;
    }
}

/****************************************************************************
 * Name: esp32c3_tim_setcounter
 *
 * Description:
 *   Set the value to be loaded to the counter.
 *   If you want the counter to be loaded at an alarm, enable the alarm and
 *   the auto-reload before.
 *   If you want the counter to be loaded instantly, call
 *   esp32c3_tim_reload_now() after this function.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   value         - The value to be loaded the counter.
 *
 ****************************************************************************/

static void esp32c3_tim_setcounter(struct esp32c3_tim_dev_s *dev,
                                  uint64_t value)
{
  uint64_t low_64 = value & LOW_32_MASK;
  uint64_t high_64;
  struct esp32c3_tim_priv_s *priv;
  DEBUGASSERT(dev);
  priv = (struct esp32c3_tim_priv_s *)dev;

  if (priv->id == ESP32C3_SYSTIM)
    {
      high_64 = (value >> SHIFT_32) & LOW_20_MASK;

      /* Set the counter 1 value */

      putreg32((uint32_t)low_64, SYS_TIMER_SYSTIMER_UNIT1_LOAD_LO_REG);
      putreg32((uint32_t)high_64, SYS_TIMER_SYSTIMER_UNIT1_LOAD_HI_REG);

      /* Synchronize */

      putreg32(SYS_TIMER_TIMER_UNIT1_LOAD_M,
               SYS_TIMER_SYSTIMER_UNIT1_LOAD_REG);
    }
  else
    {
      high_64 = (value >> SHIFT_32) & LOW_22_MASK;

      /* Set the counter value */

      putreg32((uint32_t)low_64, TIMG_T0LOADLO_REG(priv->id));
      putreg32((uint32_t)high_64, TIMG_T0LOADHI_REG(priv->id));
    }
}

/****************************************************************************
 * Name: esp32c3_tim_reload_now
 *
 * Description:
 *   Reload the counter instantly. It may be called after
 *   esp32c3_tim_setcounter().
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *
 ****************************************************************************/

static void esp32c3_tim_reload_now(struct esp32c3_tim_dev_s *dev)
{
  struct esp32c3_tim_priv_s *priv;
  DEBUGASSERT(dev);
  priv = (struct esp32c3_tim_priv_s *)dev;

  if (priv->id == ESP32C3_SYSTIM)
    {
      /* Load immediately */

      putreg32(SYS_TIMER_TIMER_UNIT1_LOAD_M,
               SYS_TIMER_SYSTIMER_UNIT1_LOAD_REG);
    }
  else
    {
      /* Dummy value to trigger reloading  */

      putreg32(BIT(0), TIMG_T0LOAD_REG(priv->id));
    }
}

/****************************************************************************
 * Name: esp32c3_tim_getalarmvalue
 *
 * Description:
 *   Get the alarm value.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   value         - Pointer to retrieve the current configured alarm value.
 *
 ****************************************************************************/

static void esp32c3_tim_getalarmvalue(struct esp32c3_tim_dev_s *dev,
                                   uint64_t *value)
{
  uint32_t value_32;
  struct esp32c3_tim_priv_s *priv;
  DEBUGASSERT(dev);
  priv = (struct esp32c3_tim_priv_s *)dev;
  *value = 0;
  if (priv->id == ESP32C3_SYSTIM)
    {
      /* Read value */

      value_32  = getreg32(SYS_TIMER_SYSTIMER_TARGET2_HI_REG); /* High 32 bits */

      /* Get only the 20 low bits. */

      value_32 &= LOW_20_MASK;
      *value   |= value_32;
      *value  <<= SHIFT_32;
      value_32  = getreg32(SYS_TIMER_SYSTIMER_TARGET2_LO_REG); /* Low 32 bits */
      *value   |= value_32;
    }
  else
    {
      /* Read value */

      value_32  = getreg32(TIMG_T0ALARMHI_REG(priv->id)); /* High 32 bits */

      /* Get only the 22 low bits. */

      value_32 &= LOW_22_MASK;
      *value   |= value_32;
      *value  <<= SHIFT_32;
      value_32  = getreg32(TIMG_T0ALARMLO_REG(priv->id)); /* Low 32 bits */
      *value   |= value_32;
    }
}

/****************************************************************************
 * Name: esp32c3_tim_setalarmvalue
 *
 * Description:
 *   Set the value that will trigger an alarm when the
 *   counter value matches this value.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   value         - The alarm value.
 *
 ****************************************************************************/

static void esp32c3_tim_setalarmvalue(struct esp32c3_tim_dev_s *dev,
                                      uint64_t value)
{
  struct esp32c3_tim_priv_s *priv;
  DEBUGASSERT(dev);
  priv = (struct esp32c3_tim_priv_s *)dev;

  if (priv->id == ESP32C3_SYSTIM)
    {
      uint64_t low_64  = value & LOW_32_MASK;
      uint64_t high_64 = (value >> SHIFT_32) & LOW_20_MASK;

      /* Set an alarm value */

      putreg32((uint32_t)low_64, SYS_TIMER_SYSTIMER_TARGET2_LO_REG);
      putreg32((uint32_t)high_64, SYS_TIMER_SYSTIMER_TARGET2_HI_REG);

      /* Synchronize */

      putreg32(SYS_TIMER_TIMER_COMP2_LOAD_M,
               SYS_TIMER_SYSTIMER_COMP2_LOAD_REG);
    }
  else
    {
      uint64_t low_64  = value & LOW_32_MASK;
      uint64_t high_64 = (value >> SHIFT_32) & LOW_22_MASK;

      /* Set an alarm value */

      putreg32((uint32_t)low_64, TIMG_T0ALARMLO_REG(priv->id));
      putreg32((uint32_t)high_64, TIMG_T0ALARMHI_REG(priv->id));
    }
}

/****************************************************************************
 * Name: esp32c3_tim_setalarm
 *
 * Description:
 *   Enable/Disable the alarm.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   enable        - A variable to indicate the action. If true, enable
 *                   the alarm, if false, disable it.
 *
 ****************************************************************************/

static void esp32c3_tim_setalarm(struct esp32c3_tim_dev_s *dev,
                                 bool enable)
{
  struct esp32c3_tim_priv_s *priv;
  DEBUGASSERT(dev);
  priv = (struct esp32c3_tim_priv_s *)dev;

  if (priv->id == ESP32C3_SYSTIM)
    {
      if (enable)
        {
          /* Enable Comparator 2 */

          modifyreg32(SYS_TIMER_SYSTIMER_CONF_REG, 0,
                      SYS_TIMER_TARGET2_WORK_EN_M);
        }
      else
        {
          /* Disable Comparator 2 */

