apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_tim.c
          modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, 0, SYSTEM_TIMERGROUP_CLK_EN);
          modifyreg32(SYSTEM_PERIP_RST_EN0_REG, SYSTEM_TIMERGROUP_RST_M, 0);

          break;
        }
#endif

#ifdef CONFIG_ESP32C3_TIMER1
      case 1:
        {
          tim = &g_esp32c3_tim1_priv;

          modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, 0,
                      SYSTEM_TIMERGROUP1_CLK_EN);
          modifyreg32(SYSTEM_PERIP_RST_EN0_REG, SYSTEM_TIMERGROUP1_RST_M, 0);

          break;
        }
#endif

#ifdef CONFIG_ESP32C3_RT_TIMER
      case 2:
        {
          tim = &g_esp32c3_tim2_priv;

          /* Clock and reset of systimer peripheral is already  performed
           * either in esp32c3_timerisr.c or in esp32c3_tickless.c.
           * Set comparator 2 to use counter 1 and set the mode
           * to oneshot mode, i.e., disable periodic mode.
           */

          modifyreg32(SYS_TIMER_SYSTIMER_TARGET2_CONF_REG,
                      SYS_TIMER_TARGET2_PERIOD_MODE_M,
                      SYS_TIMER_TARGET2_TIMER_UNIT_SEL_M);
          break;
        }
#endif

      default:
        {
          tmrerr("ERROR: unsupported TIMER %d\n", timer);
          goto errout;
        }
    }

  /* Verify if it is in use */

  if (tim->inuse == false)
    {
      tim->inuse = true;  /* If it was not, now it is */
    }
  else
    {
      tmrerr("ERROR: TIMER %d is already in use\n", timer);
      tim = NULL;
    }

errout:
  return (struct esp32c3_tim_dev_s *)tim;
}

/****************************************************************************
 * Name: esp32c3_tim_deinit
 *
 * Description:
 *   Deinit TIMER device.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *
 ****************************************************************************/

void esp32c3_tim_deinit(struct esp32c3_tim_dev_s *dev)
{
  struct esp32c3_tim_priv_s *tim = NULL;

  DEBUGASSERT(dev);

  tim = (struct esp32c3_tim_priv_s *)dev;
  tim->inuse = false;
}
